joker717pig/test/sdkconfig.defaults
# =====================================================================
# EDA_EMG_ESP32 sdkconfig defaults
# HW: ESP32-S3-WROOM-1-N16R8 (16MB Flash / 8MB Octal PSRAM)
# NOTE: keep this file ASCII-only so kconfgen works on any Windows locale (GBK/UTF-8)
# =====================================================================
CONFIG_IDF_TARGET="esp32s3"

# --- Board exposes serial only via USB-Serial-JTAG (no UART0 converter); console over USB ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- 0.4 Flash / PSRAM (N16R8) ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y                # 8MB Octal PSRAM required
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y  # Allow task stacks in PSRAM (renamed from CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY)

# --- 阶段 D 内存修正：WiFi 驱动 DMA 缓冲需大量内部 SRAM，LVGL 小对象会挤爆内部 ---
# >2KB 的 malloc 导向 PSRAM（默认 16KB 会把 LVGL 控件/字体 glyph 全塞内部，挤掉 WiFi DMA 缓冲）
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
# 为 DMA/任务栈等必须内部 RAM 的请求保留 64KB 池（默认 32KB，WiFi init 报 ESP_ERR_NO_MEM）
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
# WiFi/lwIP 缓冲优先分配到 PSRAM（合并中英文 UI + 语音后内部 SRAM 见底，
# esp_wifi_init 报 ESP_ERR_NO_MEM / "create wifi task: failed to create task" 的根因）。
# 开启后 WiFi RX/TX 与 lwIP 缓冲挪到 PSRAM，腾出内部 SRAM 给 WiFi 任务栈/DMA；失败自动回退内部 RAM。
# 依赖 SPIRAM_USE_MALLOC（已开）。改此项后必须删根目录 sdkconfig 重新生成再 build。
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- 0.4 Logging / C++ / stack check ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y        # C++ exceptions (may be used by UI later; disable to save flash)
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y  # Method 2 canary stack-overflow check (was CHECK_STACKOVERFLOW=2)
# Event-loop task stack: RTC-poll etc. handlers run modbus transactions (256B rx buf + printf);
# default 2304 overflows -> raised to 8K
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_USE_TRACE_FACILITY=y          # Stack water-mark via uxTaskGetSystemState (configUSE_TRACE_FACILITY)
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y     # Task CPU run-time stats (stage B1 diag: console top cmd)
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# --- 0.5 Partition table (no OTA): custom table incl. storage(~12MB) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 0.D Display: SPI clock 80MHz (max; lower here if screen glitches) ---
CONFIG_LCD_SPI_CLK_HZ=80000000

# =====================================================================
# 1.4 LVGL 9.5.0 Kconfig (via esp_lvgl_port; RGB565 + PSRAM double buffer)
# Note: LVGL component Kconfig options map to CONFIG_LV_* (generates lv_conf_kconfig.h)
# =====================================================================
CONFIG_LV_COLOR_DEPTH_16=y                  # RGB565 (panel color format; 16 is default, explicit)
CONFIG_LV_USE_CLIB_MALLOC=y                 # LVGL uses standard malloc -> ESP-IDF heap (incl. PSRAM), objects can live in PSRAM
CONFIG_LV_USE_OBSERVER=y                    # Observer (prereq of esp_lvgl_port perf monitor; default y)
CONFIG_LV_USE_SYSMON=y                      # System monitor (perf monitor prereq)
CONFIG_LV_USE_PERF_MONITOR=n                # Stage B1 diag: off while chasing 99% CPU from SPIFFS image re-decode
CONFIG_LV_USE_FONT_COMPRESSED=y             # RLE compressed font decode; lv_font_conv outputs bitmap_format=1 by default,
                                            # MUST be on or CJK won't render! (pitfall 1.8)
CONFIG_LV_FONT_MONTSERRAT_10=y              # [我们] 英文UI: 客户定稿用 montserrat 10/12/14/16/18/20/26/28/30
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_BUILD_EXAMPLES=n                  # Skip official examples (saves flash/build time)
CONFIG_LV_BUILD_DEMOS=n                     # Skip official demos

# === Image decode cache (fix: therapy page key-nav slow, set_src re-decode) ===
# Default 0 = disabled -> every lv_image_set_src re-decodes whole image on redraw.
# Enabling puts decoded images in PSRAM (>2KB malloc goes to PSRAM), 2nd+ swap is 0-decode.
# 8MB PSRAM is ample: 256KB cache ~3% only, PSRAM-only, not internal SRAM.
CONFIG_LV_CACHE_DEF_SIZE=262144
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=32

# === bin decoder RAM load (fix: image cache was bypassed for RGB565/RGB565A8) ===
# With RAM_LOAD off, RGB565/RGB565A8/RGB888 are stream-decoded in get_area_cb,
# so dsc->decoded==NULL -> lv_image_decoder_add_to_cache is never called, and
# LV_CACHE_DEF_SIZE above has no effect for these icons. Enabling decodes the
# whole image to RAM once; subsequent lv_image_set_src hits the image cache.
# RAM cost ~9KB per icon x8 icons ~= 70KB in PSRAM (no pressure on 8MB PSRAM).
CONFIG_LV_BIN_DECODER_RAM_LOAD=y

# =====================================================================
# Stage S0: SPIFFS filesystem (storage_a / storage_b dual image slots)
# =====================================================================
CONFIG_SPIFFS_MAX_PARTITIONS=2
CONFIG_SPIFFS_USE_MTIME=y

# =====================================================================
# Stage D: OTA (WiFi STA + HTTP client + HTTPS bundle + dual storage)
# - 手机热点联网: esp_wifi STA 默认启用, 本工程仅做 STA(不启 SoftAP, 省 flash)
# - HTTPS 下载: 公网 OSS/静态托管(决策 D4); x509 bundle 信任公网 CA
# =====================================================================
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# OTA 双区回滚: 快速回滚(上电即判断)可在 app 校验失败时立即回退
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# =====================================================================
# Stage B1: LVGL FS driver (STDIO mode, ESP-IDF VFS transparently maps fopen->SPIFFS)
# letter='S' (ASCII 83), path prefix /spiffs -> lv_binfont_create("S:/font/xxx.bin")
# =====================================================================
# === 缓冲空间与图片解码: 本工程在 PSRAM 分配大缓冲(LVGL cache + FS STDIO cache) ===
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/spiffs"
CONFIG_LV_FS_STDIO_CACHE_SIZE=4096
